eseawind/MCU/msp430/test_main/码盘测速_0817.c
/**********************************************
 *
 * 		Author	:		Shawn Guo
 *      Mail    :       iguoxiaopeng@gmail.com
 * 		Date	:       2013/8/4
 *      Last    :       2013/8/6
 * 		Notes	:
 * 		Tool    :       MSP430X2XX  smart car 测速test
 **********************************************/

#include <msp430f2618.h>
#include "clock.h"
#include "LCD5110.h"
#include "Timer.h"
#include "drive.h"
#include "track.h"

unsigned char LCD_BUFFER1[] = "Speed:";

extern int SPEED_COUNT_L, SPEED_COUNT_R, SPEED_BUF_L, SPEED_BUF_R;
extern unsigned char SPEED_DISPLAY_FLAG;
int SPEED_L = 0, SPEED_R = 0;

int speed = 40;

int main()
{
    WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT

    Clock_Init(0,0,0,CPU_FF);

    LCD5110_Init();
    LCD5110_Write_String(0, 0, (char*)LCD_BUFFER1);

    //Drive_Init(0,50);
    Drive_IO_Init();
    Drive_PWM_Init();
    Drive_Servo_Init();
    Drive_Speed_IO();


    Drive_Motor_L(0, 50);
    Drive_Motor_R(0, 50);

    _EINT();

    while(1)
    {
        if(SPEED_DISPLAY_FLAG == 1)
        {
            SPEED_DISPLAY_FLAG = 0;

            SPEED_L = Drive_Speed_Journey_L();
            SPEED_R = Drive_Speed_Journey_R();
            LCD5110_Long2Char(SPEED_L);
            LCD5110_Write_String(36, 0, 0);
            LCD5110_Long2Char(SPEED_R);
            LCD5110_Write_String(36, 1, 0);
        }
    }
}

#pragma vector=PORT2_VECTOR
__interrupt void P2_ISR (void)
{
    if(P2IFG & SPEED_BITL)
    {
        SPEED_COUNT_L++;
    }
    if(P2IFG & SPEED_BITR)
    {
        SPEED_COUNT_R++;
    }

    // ....something else.
    P2IFG = 0;
}

#pragma vector=TIMERA0_VECTOR
__interrupt void TimerA0(void)  //5s中断显示,显示速度.
{
    static int i = 0;

    if(++i >= 1000)
    {
        i = 0;
        SPEED_DISPLAY_FLAG = 1; //显示SPEED
        SPEED_BUF_L = SPEED_COUNT_L;
        SPEED_BUF_R = SPEED_COUNT_R;
        SPEED_COUNT_L = 0;
        SPEED_COUNT_R = 0;
    }
}


#pragma vector=TIMERB1_VECTOR           //舵机TimerB1中断, 20ms中断一次.
__interrupt void TimerB1(void)
{
    switch(TBIV)                //  TB中断源软件判断,R0有自己单独的中断向量
    {
    case 2:          // 中断源为R1, 超声波测距中断端口

        break;
    case 4:          // 中断源为R2
        break;
    case 6:             // R3
        break;
    case 8:             // R4
        break;
    case 10:             // R5
        break;
    case 12:             // R6
        break;
    case 14:         // 中断源为Timer_B
        break;
    }

}
